  Log file open: DevinVsProto
        T.J.> Log open
        T.J.> You all know the rules and all the fun stuff?
  protodude_> I do.
        T.J.> Boundries are in between the safes and below the sign
        T.J.> Anything out of that is, like, so totally illegal
       Devin> ok...
       Devin> and just no cloaking or other lameness?
  protodude_> Don't be Lucon.
       Devin> time to hurry up and lose this match.
        T.J.> No cloaking or excesvielly power attacks
        T.J.> i.e. Levi bombs
       Devin> I don't know why I signed up >.> <.<
        T.J.> No items
        T.J.> No pants
        T.J.> Got it?
  protodude_> Aww... damn.
  protodude_> What about shorts?
        T.J.> Surer
       Devin> THEY'RE COMFY AND EASY TO WEAR
  protodude_> XD
       Devin> and that was caps lock
        T.J.> Everyone ready?
  protodude_> Jah!
        T.J.> When i say go, you'll have fifteen minutes
       Devin> Might as well be
        T.J.> I'll report scores at ten and five
       Devin> mmka
    UrutoraD> And 1
  protodude_> And 0.
        T.J.> GO!
T   UrutoraD> Bets?
T       T.J.> I bet Devin on Proto
T Jacen Solo> score?
  protodude_> Woah
  protodude_> My aim is off
       Devin> ?
T   UrutoraD> I wonder if he'll use the platform hugging strategy
  protodude_> ...Wow.
       Devin> me everything is off
  protodude_> I should say that more often
       Devin> and of course I ran into a shot while typing heh
T       T.J.> Proto - 1  Devin - 0
T       T.J.> Nice shot
  Next automated tournament is starting. Type ?go tourny to play
        T.J.> If you accidentally pick up the power ball, please fire it away from the arena
T Jacen Solo> fire it towards ?go elim?
  protodude_> I'm firing it
        T.J.> Proto
       Devin> how do you turn off your name?
       Devin> it's gettin annoying heh
  Jacen Solo> esc then f3 until it's gone
T       T.J.> Ouchies
       Devin> always hiding
       Devin> and I always lose to you eh
  protodude_> Nice shootin'.
        T.J.> Ten minutes remaining
        T.J.> SCORES
        T.J.> Proto - 2
        T.J.> Devin - 2
  protodude_> O_O
       Devin> aww. that missed me
  protodude_> Holy Crap.
       Devin> wee I lose
  protodude_> Still 8-9 minutes left.
  protodude_> A lot can happen
       Devin> I haven't practicced in months
T       T.J.> Do something you bastards!
       Devin> are ship changes allowed?
    UrutoraD> Yes
       Devin> ok
  protodude_> Eep
        T.J.> Not when being actively hunted though -_-;;
        T.J.> Remember, no rocketrs
       Devin> wow.
       Devin> oh...
       Devin> I thought just no lev bombs
  protodude_> He means the Rockets
  protodude_> The fast things
  protodude_> You know
  protodude_> F3
       Devin> Yeah. so now using javs main weapons...
       Devin> oh
  protodude_> You can use bombs
       Devin> everything is horribly timed
       Devin> can I forfeit?
    UrutoraD> Yes
       Devin> parents just got home so dogs are running around barking and making a mes
       Devin> and I have to help them
  protodude_> Pause Match?
        T.J.> Sure
  protodude_> Back to safe zones?
       Devin> meh... either way...
       Devin> I';m behind by 4 heh
        T.J.> Both of you press insert and don;t move
        T.J.> Stay there
        T.J.> Time paused
        T.J.> Five minutes reamin, how convinient
        T.J.> SCORES
        T.J.> Proto - 6
        T.J.> Devin - 3
  protodude_> I can't wait to read the commentary.
  protodude_> :p
        T.J.> We will resume play once Devin returns
  protodude_> Oh, speaking of which
  protodude_> Hello, Future self who is reading this right now.
T       T.J.> Proto's Future Self> Man, why was I such an idiot back then?
  protodude_> Sooo......... how 'bout that Valentine's Day?
    UrutoraD> It burns with a thousand flames
       Devin> alrighty...
       Devin> I think I have time to finish this heh
       Devin> today is a messed up day
  protodude_> TJ, start it up!
        T.J.> Alright....ready?
       Devin> sure
  protodude_> Mm-hmm.
        T.J.> GO!
  protodude_> Ooo
  protodude_> Lancaster
       Devin> new lancs feel odd
  protodude_> Yeah
       Devin> well I suck at that ship too heh
T       T.J.> SPIDAH!
  protodude_> I'm torn between new and old lanc.
       Devin> yey for having noclue what I'm doong ^_^
  Visit www.trenchwars.org for Trench Wars related info and news
T       T.J.> Proto has Martix-like reflexes!
  protodude_> Ow
T       T.J.> Double kill, heh
  Next elimination match is starting. Type ?go baseelim to play
  Next elimination match is starting. Type ?go elim to play
T       T.J.> Ouch
       Devin> heh
       Devin> I can't hit anything
T       T.J.> A Terr? O.o;;
       Devin> going too fast ._.
T   UrutoraD> You suck at picking winners :P
        T.J.> Remember, no ports or bursts
T       T.J.> No, I think proto's gonna win
       Devin> wee.
       Devin> I lost ^_^
T       T.J.> I Devin was my betting money
       Devin> how much time?
  protodude_> Nice
T       T.J.> Nice shot Devin
        T.J.> Oh....uh...Time's up! ^^;;;;;
  protodude_> XD
       Devin> bah
       Devin> just when I was doing good
       Devin> wee I lost
        T.J.> Everyone loses!
       Devin> yeah
        T.J.> FINAL SCORES
        T.J.> Proto - 10
       Devin> I haven't practiced inmonths
        T.J.> Devin - 6
        T.J.> Congrats to Proto!
  protodude_> Wee.
       Devin> wee I got so horrifying smoked because I suck!
        T.J.> And congrats to Devin too!
  protodude_> Devin
    UrutoraD> Woo
        T.J.> Any last words before I close the log?
  protodude_> That wasn't smoked.
  protodude_> You should have seen Balikka and.
  protodude_> ...Uhh...
    UrutoraD> 4 more matches left
       Devin> um...
       Devin> save the whales?
       Devin> ... all of them?
  protodude_> Shave the whales.
        T.J.> Log closed
