  Log file open: NessVsStriker
  Striker Om> Or just ?log file
        T.J.> Log open
        T.J.> NOW you can count down
    Madarrow> 5
    Madarrow> 4
  Striker Om> Blasta is laughing at us. ._.
    Madarrow> 3
    Madarrow> 2
    Madarrow> 1
    Madarrow> GO!
T       T.J.> Anyone besides me who speaks in pub chat dies
  NessTheHer> eeeeeeeeeeeeeeeeeeeeeeeeeeeeee
T       T.J.> And them
  NessTheHer> Power overwhelming
T       T.J.> Mad, give me alerts at 10,5, and 1
  NessTheHer> aww
T protodude_> What if we do?
T protodude_> ...Where did everyone go?!
T protodude_> There were like, 7 or 8 people in here!
T       T.J.> They're gone
T protodude_> Why?
T   Madarrow> Practicing.
T       T.J.> I don;t know why!
T       T.J.> because you're annoying!
T protodude_> ...
T protodude_> That hurts...
T protodude_> Not on the outside...
T protodude_> but on the inside...
T protodude_> where it counts...
T protodude_> ;_;
  NessTheHer> whew
T protodude_> ...And now, Shigeru Miyamoto time! >D
  NessTheHer> aww
  Striker Om> BOOM
  Striker Om> Haha, this is great
T       T.J.> You evenly matches pansies!
  Striker Om> Or not
  NessTheHer> lol
        T.J.> Umm....spawn kill?
  NessTheHer> where?
        T.J.> You
  Striker Om> If it was, I'll let it go.
  NessTheHer> when!?
        T.J.> Your last kill
  NessTheHer> whoops
        T.J.> Striker hadn't fired on you yet
        T.J.> And it was under four seconds
T       T.J.> *tosses Ness out the window*
  Striker Om> Switching ships.
        T.J.> Mkay
  Striker Om> BOOM
  Striker Om> again
  Next elimination match is starting. Type ?go baseelim to play
  Next elimination match is starting. Type ?go elim to play
  NessTheHer> yay
T       T.J.> Okay, I take that back, ness is pwning him
  Striker Om> Boom.
  NessTheHer> Nuts
    Madarrow> Ness:12   Striker:9
T       T.J.> I said alert, not steal my job
  Striker Om> Shewy
T protodude_> Huh?
  Striker Om> Shewt even
T       T.J.> We go by my scorebox, not yours Mad
  NessTheHer> Chewbacca!
  Striker Om> But then Shewy is better
  NessTheHer> Pause
T   Madarrow> Thats not what we did last match...
  Striker Om> ?
T       T.J.> Well, they blew it last match
  NessTheHer> timer?
T   Madarrow> But whatever.
    Madarrow> 8 min
  NessTheHer> Paused?
    Madarrow> Yeah
  NessTheHer> gimme a sec
  NessTheHer> AIM
        T.J.> Everyone back to your safes
  NessTheHer> Alright, ready
        T.J.> Resume
        T.J.> Ness?
  NessTheHer> oh
  NessTheHer> I was waiting for 321 go
T       T.J.> -_-;;
  Striker Om> ...? Oh.
T protodude_> Huh?
T protodude_> What did someone say about last match and doing stuff?
T       T.J.> Read up
  NessTheHer> nuts
  Striker Om> Heh.
  Striker Om> BOOM
T protodude_> I did
C 1:UrutoraD> European :P
T protodude_> Oh
T protodude_> What's the time now?
T protodude_> All I know, is that Ness is winning.
  NessTheHer> These aren't spawn kills, are they?
  Striker Om> No
        T.J.> Eh, i missed the, so no
  NessTheHer> okay
T protodude_> Wow, we have an On the Job Judge, don't we? :p
C 1:UrutoraD> :P
T       T.J.> At least I'm trusted to be a judge
P :UrutoraD:Uru, get off squad chat
T protodude_> Wow... you signed up and clicked the button that says, "I would like to be a Judge"
T protodude_> :p
P (UrutoraD)>Foo
T   Madarrow> 5 min TJ
T       T.J.> Ness lost that data
        T.J.> 5 Mins remaining
T protodude_> No like I actually would WANT to be a judge.
        T.J.> Ness - 20
        T.J.> Striker - 17
T protodude_> OH GOD!
T protodude_> MR. ARROGANT!
T protodude_> HE RETURNS!!!!
  To report cheaters and teamkillers to moderators type ?cheater cheater name, what he is doing
T protodude_> AHHHHHH!!!!!!!
  Striker Om> BOOM
  Striker Om> BOOM
  Striker Om> Oi
P (UrutoraD)>Mr.Arrogant
P (UrutoraD)>Whoops
  Striker Om> cmoooon
T   Madarrow> 1 min TJ
        T.J.> 1 Min remaining
        T.J.> Run for your lives
  Striker Om> BOOM
T protodude_> Close Mizatch
    Madarrow> GAME OVER!
T protodude_> Ness just needs to play Keep away.
T protodude_> Or...
T protodude_> /Not
        T.J.> Final scores
        T.J.> Ness - 28
  NessTheHer> jeez
        T.J.> Striker - 26
  NessTheHer> I'm so tense right now
        T.J.> Congrats to Ness!
        T.J.> And good job to Striker!
  NessTheHer> gg Striker
T   UrutoraD> gmo
  Striker Om> Yeah.
  protodude_> We need to but both Logs up
        T.J.> Any last words before I close the log?
  protodude_> I do!
  Blade_Serp> How did you lose to NESS?! >.>
  Striker Om> I'm glad that even though I didn't win
  NessTheHer> I LOVE NEW YORK!!!
    Madarrow> NEXT MATCH!
  Striker Om> I gave him hell anyway.
  protodude_> Wait!
    UrutoraD> Ahh!
  NessTheHer> Yes
    UrutoraD> I'm nervous again!
  NessTheHer> You were a good opponent
  Striker Om> We were pretty much even.
  Blade_Serp> That sucks. :P
        T.J.> Log closed
