  Log file open: session.log
T   UrutoraD> SUCKAAAAAAAAAAAAAAAAAAAAAAAAAAAA
  protoman_1> Maybe >_>
        T.J.> LOG OPEN
  protoman_1> Lawl I like logs.
  NessTheHer> Contestants to opposing safes, please
  Striker Om> logalogalogalog
  protoman_1> OMG MATCH
T       T.J.> Greetings ladies and gentleman and welcome to the second match of SquadBnG's Tournament of Awesome!
T   UrutoraD> Shut up
T NessTheHer> hooray!
       Cuddy> XD
T NessTheHer> NO U
  protoman_1> omg brb need to eet food.
  A Game of Tribia is about to being at ?go Trivia 
  protoman_1> brb in 3000 hours.
T       T.J.> Today in the arena we have two combatants...
T NessTheHer> Team chat only please
T      Forai> lets hope it doesn't end up with a failed pregnancy test and an abortion like last years...
  Striker Om> I swear I'm going to kill you.
  Striker Om> Or...something.
  protoman_1> I'm joking, I'm joking.
T       T.J.> "I play too many games" Genryu!
T Blade_Serp> Yo all.
T      Cuddy> lawl
  Striker Om> I must have too much of a serious-guy image. I confuse people when I joke.
T       T.J.> And "Greek Alphabet Man" Striker!
  protoman_1> O rly?
T   UrutoraD> lawls
  protoman_1> I wonder what they're saying about us in the yellow chat.
T Blade_Serp> Bets?
T NessTheHer> Shall we begin, chaps?
  Striker Om> Despite random bouts of spazzing out. I mean, what the hell was going on in the channel a minute ago?
  NessTheHer> Fighters ready?
T   UrutoraD> Your mom
T Blade_Serp> I'll vote on Proto.
  Striker Om> As ready as I'll ever be
T       T.J.> I must remind all viewers that pub chat, squad chat, and chat chat are strictly prohibited during the match
  NessTheHer> Proto?
  protoman_1> Yes'm, boss.
T Blade_Serp> Yea yea.
  NessTheHer> Okay
  protoman_1> OR am I?
  NessTheHer> You have 15 minuutes
  NessTheHer> GO
T      Forai> what about TEAMSPEAK chat HMM?
T      Forai> yeah, he's out of my channel, don't worry
T Blade_Serp> AND THEY'RE OFF
T NessTheHer> TEAMSPEAK
T      Forai> infact I think he logged off
T      Forai> ohwell
  protoman_1> o_O
T Blade_Serp> ...
       Cuddy> O.o
T       T.J.> All viewers are welcome to place bets
T   UrutoraD> ...
  protoman_1> Wow, I killed him so hard he LEFT.
  NessTheHer> PAUSE
T      Forai> THE SHOT HEARD ROUND THE WORLD@
  Blade_Serp> Shot him a bit hard, don't ya think?
       Cuddy> you haxed him
T   UrutoraD> 1 minute, right?
  Striker Om> Grr
  NessTheHer> okay
  protoman_1> I killed you hard, didn't I?
T       T.J.> Shot straight to disconnect, very nice Genryu
  NessTheHer> GO
T Blade_Serp> It's his uber hax
T       T.J.> A reminder to all viewers to remain in frequency chat
T       T.J.> Any bets?
T Blade_Serp> Someone remind me how to set my thing to follow one of them auto?
T Blade_Serp> It's gonna be Proto, hands down
T   UrutoraD> Tab
T NessTheHer> Select them
T  Fusion_AX> I bet something I don't have.
T       T.J.> Select them in your list and press ctrl
T NessTheHer> and hit CTRL
T   UrutoraD> On name
T      Cuddy> wow, how very supportive of you blade
T      Cuddy> XD
T       T.J.> I'm betting Striker on Gen
T Blade_Serp> Well, it is.
T      Forai> looks like genryu's trying to play the "Accurate hit" game, while strikers playing the "zerg rush bullets" game...
T Blade_Serp> Striker has multi on, that takes his rate of fire down to crap
T       T.J.> Good assesment Forai
T   UrutoraD> roffle
T Blade_Serp> He can't kill Proto unless he nails him right when Proto fires
T   UrutoraD> 1773 hours played
T      Forai> yeah
T      Cuddy> I hate announcers. XD
T      Forai> wow
T NessTheHer> Announcers hate YOU
T      Forai> gen just keeps killing
T       T.J.> Ouch, snipered
T      Cuddy> dur, I don't know all this myself, please fill me in
T      Forai> in soviet (zerg) rusha
T      Cuddy> XD
  Information regarding the upcoming BD Tournament is up. http://forums.trenchwars.org/showpost.php?p=448382&postcount=1  cheers -nethila 
T       T.J.> XD
T Blade_Serp> Striker isn't even in Gen's league.
T   UrutoraD> Who else had a large play time?
T   UrutoraD> Lucon?
T Blade_Serp> What's the time command again?
T      Cuddy> is anyone in gen's league?
T   UrutoraD> .?usage
T      Forai> I used to play alot... but on EG
T   UrutoraD> I am!
T Blade_Serp> Heh. 191 hours.
T       T.J.> Striker is trying to catch Gen off gaurd, but it doesn't appear to be working so far
T NessTheHer> 549
T Blade_Serp> KILLING SPREE
T      Forai> nope
  Striker Om> rusty, my ass.
T      Forai> XD
T   UrutoraD> I'm sure I beat Gen
T      Forai> RUSTY ASS!
  protoman_1> I was rusty yesterday!
T       T.J.> Sorry Striker, but Rusty's not here
T      Cuddy> lol.
T Blade_Serp> RAMPAGE
T   UrutoraD> First played: 7-29-2003
T      Cuddy> geez
  protoman_1> And I only got like, 2 minutes of practice today
T       T.J.> I believe the appropriate term is rape
T  Fusion_AX> Striker is the most pitiful lanc I've ever seen.
T NessTheHer> For last match, did you guys have a log and upload it?
T Blade_Serp> UNSTOPPABLE
  Striker Om> I'd hate to see you when you're on your game.
T   UrutoraD> It's like me vs Redeal
T      Cuddy> I'm glad I wasn'y gonna play gen if it was gonna be like this
T   UrutoraD> Mag had a log
T Blade_Serp> I predict he's gonna win
T       T.J.> Ask Mag or Gen, Ness. I forgot to log
T Blade_Serp> Him or Uru
T NessTheHer> k
T   UrutoraD> Eh
T Blade_Serp> Maybe me, who kows
T Blade_Serp> knows*
T   UrutoraD> I'm not thet good
T   UrutoraD> that
T       T.J.> Gen's bouncing off the asteroids like a pinball :O
T Blade_Serp> Mad's got a good shot at it too
T  Fusion_AX> POSTAL WORKER
T   UrutoraD> Lancs suck
  protoman_1> I also had too much sugar
T   UrutoraD> There be proof right there
T Blade_Serp> Lancs rock, when not on multi
  protoman_1> Shakey
T   UrutoraD> roffle
T Blade_Serp> They get almost 3 shots insta
  NessTheHer> 10 minutes
T Blade_Serp> Multi is crap for a solo fight
  NessTheHer> score: 9 - 0
T       T.J.> Agreed
T Blade_Serp> You can't shoot fast enough to kill
  NessTheHer> Protoman
T Blade_Serp> GODLIKE
  Striker Om> I honestly don't know what's going on here. I am sucking hard.
T   UrutoraD> But you only hit when in the base
T   UrutoraD> lawls
T Blade_Serp> HOLY SHIT
  Striker Om> I humbly aplogize for this farce. XD
T   UrutoraD> So
  protoman_1> XD
T Blade_Serp> </UT Announcer>
T       T.J.> 76 bounty, not bad
T      Cuddy> I'm glad I'm not in vent. :P
  protoman_1> Lawl
  protoman_1> You said Farce
T      Forai> I'm not in either
  protoman_1> Which rhymes with Arse
T      Cuddy> are you glad?
T   UrutoraD> I predict this is the next Uru vs Redeal >.>
       Cuddy> :O
T Blade_Serp> :I
T NessTheHer> Yay!
T       T.J.> A hit!
  protoman_1> omg
  Blade_Serp> :O
T   UrutoraD> zomg
  Striker Om> zomgWUT?
T  Fusion_AX> OH HO!
T       T.J.> Striker scores!
T NessTheHer> All is not lost!
T       T.J.> Blade, stick to freq chat
T NessTheHer> yet
T Blade_Serp> Sorry, finger slipped
T   UrutoraD> .?sheep is fun
T Blade_Serp> Speaking of Vent, Gardius is on it for some reason
T Blade_Serp> He sounds funny
T      Cuddy> :O
T       T.J.> Am I the only one experiencing lag here?
T Blade_Serp> Yea
T   UrutoraD> Yes
T   UrutoraD> Go away
T Des Gardiu> Heyo
T   UrutoraD> SHUT UP
T       T.J.> Hi Gardius
T       T.J.> You enjoy rape, right?
  Striker Om> dang
T Des Gardiu> Yep. :D
T Des Gardiu> So who's winning?
T       T.J.> Gen
  Next elimination match is starting. Type ?go elim to play
T  Fusion_AX> What does this match GO to?
T NessTheHer> 12 - 1
T Blade_Serp> Proto is demolishing
T NessTheHer> 15 minutes
T   UrutoraD> So, does anyone think Jhang's "rape" tactic is gonna work?
T       T.J.> Beats me
T NessTheHer> No
T NessTheHer> I dunno
T       T.J.> Hallo!
  protoman_1> zomgWUT?
  Striker Om> exactly
T       T.J.> Gen eats multishot
T NessTheHer> The lanc doesn't have 1 hit kills
T Blade_Serp> Yea
T Blade_Serp> We kill it multishit cause it bites outside the base
  NessTheHer> 5 Minutes remaining
  NessTheHer> Score: 12 - 2
  NessTheHer> Protoman
T Blade_Serp> Proto needs to just run like hell for 5 minutes
T   UrutoraD> No he doesn't
T Des Gardiu> Wow. You weren't kidding when you said rape
T   UrutoraD> lawls
T       T.J.> Told ya
T       T.J.> Oh!
  protoman_1> Awww.
T Blade_Serp> :O
T Des Gardiu> Watch as Striker pulls a victory out of his ass
T NessTheHer> OH BURN
T       T.J.> Punched in the face!
T  Fusion_AX> Striker's making a comeback.
T Blade_Serp> He might.
T   UrutoraD> Remember when Lucon warped?
T Blade_Serp> No
  Next elimination match is starting. Type ?go baseelim to play
T       T.J.> Yeah, I think that's a squad quote XD
T NessTheHer> No
T NessTheHer> Proto warped
T Blade_Serp> Snipe'd
T   UrutoraD> I'm sure it was Lucon
T   UrutoraD> eat zomg
T NessTheHer> And I DQed him, everyone got pissed, and I made the rules into paragraphs
T Blade_Serp> No eat
T       T.J.> All I remember of it was "<Uru> Worst. Way. To Lose. Evah"
T   UrutoraD> I didn't get pissed >.>
T NessTheHer> It was Proto
T Blade_Serp> Ask him after the fight
T Blade_Serp> HEADSHOT
T Des Gardiu> That was a nice shot
T       T.J.> Ouch...sniped
T   UrutoraD> I don't know why the tournament is still going
T   UrutoraD> I should have won right after I signed up
  protoman_1> Ring around the rocksy
  protoman_1> Pocket full of Pocky
  Striker Om> Fistful of dollars
T       T.J.> More like assfull of rape at this point
T   UrutoraD> Time?
  NessTheHer> 1 Minutes remaining
  NessTheHer> Score: 17 - 4
  NessTheHer> Protoman
T   UrutoraD> LOL!
T Blade_Serp> 1 isn't plural, Ness
T       T.J.> Striker changes to a Warbird!
T Des Gardiu> I'm gonna go check Ventrilo. See why it's so hard to be heard
T NessTheHer> Eat me
T      Forai> ... this really seems like a one sided fight now
T   UrutoraD> Remember when he wall-hugged?
T       T.J.> And it's back to Lanc
  NessTheHer> CEASE
T Blade_Serp> No shit, Forai
  protoman_1> And desist!
T       T.J.> I remember when all Blade did was hide behind the circle in front of base
    UrutoraD> HAY PROTO!!?!?!?
T       T.J.> Cheapest tactic ever
  NessTheHer> The match has ended
  Striker Om> Note to self: give self chance to practice beforehand
  Blade_Serp> Proto! A winner is you!
  NessTheHer> The winner is Protoman_116
T Blade_Serp> Wait, what?
T  Fusion_AX> Score is: 19 - 5.  Protoman wins.
T Blade_Serp> When did I do that? o.O
    UrutoraD> Was it you who warped and got DQ'd?
  Striker Om> Next tourney
T       T.J.> First Continuum tourney I was in
  protoman_1> Yes, like, at the end of the match.
T Blade_Serp> Huh
T NessTheHer> Told you guys it was proto
  protoman_1> But I didn't get DQ'd, because of a loophole in the rules.
C 1:Blade_Serpent> NOW I DEMAND RAID
  protoman_1> Then Ness covered EVERYTHING!
C 1:Fusion_AX> I'd rather duel somebody juts for the heck of it.
T   UrutoraD> No you didn't
C 1:Striker Omega> Raid would be nice
        T.J.> Well ladies and gentleman, that it for this match, tune in next time
        T.J.> Any last words?
  protoman_1> Yes
  NessTheHer> No, you didn't get DQ'd because everyone got pissed off
C 1:Blade_Serpent> Get your asses in pub 32!
  protoman_1> I am the Baconman, bring all the pork I can,
  protoman_1> to all the little kids down the row!
  protoman_1> Clogging their arteries, with all the MSG's,
  protoman_1> Then they'll all die at the age of eight!
  Blade_Serp> 7
  Striker Om> I'm disappointed in my performance. It's that simple.
C 1:NessTheHero> Screw pub 32
  Striker Om> This was not my A-game. More like my ZZ Top game. Which is bad.
  protoman_1> Good fight, Striker.
C 1:UrutoraD> RAKION
        T.J.> Alrighty then, log closed :O
  Striker Om> Not really, but thanks anyway XP
