  Log file open: uruvslex
  NessTheHer> Okay
  NessTheHer> Here we go
  NessTheHer> Fighters ready?
    UrutoraD> oh ya
  NessTheHer> lex?
       Lex24> UAR
  NessTheHer> okau
       Lex24> YAR
  NessTheHer> You have 15 minutes
  NessTheHer> GO
       Jhang> That was fast
       Jhang> So, tonight we have Urutora Versus Lex24
       Jhang> How do you feel about our contenders, Protoman?
T NessTheHer> team chat only plz
    UrutoraD> Team chat
T      Jhang>  Answer the question, Protoman!
T NessTheHer> <proto> I'm dumb. durrr
T      Jhang> Excellent Opinion, My good fellow
  NessTheHer> Lex, watch it
T protoman_1> Sorry, I was BRB.
T protoman_1> Anyways.
T protoman_1> I think Uru will win.
  NessTheHer> Be aware of the boundaries
T protoman_1> Trust me.
T protoman_1> I have 3000000 dollars.
  NessTheHer> The three safes and the base
T      Jhang> Really?
T protoman_1> He WILL win.
T      Jhang> What do you think is holding Lex Back?
T protoman_1> Suckitude.
T NessTheHer> Lack of skill?
T      Jhang> His lack of Exp?
T protoman_1> Suckitude.
    UrutoraD> >:O
T      Jhang> oooo Double Kill
T      Jhang> What is the current score?
T protoman_1> 6-0
T protoman_1> If indeed, there was a double kill.
T      Jhang> Ah! So we have a Point to Point system set up?
T NessTheHer> Double kills don't matter because they don't affect the outcome
T protoman_1> Well, yeah.
T      Jhang> So Lex hasn't gotten one kill?
T NessTheHer> Yes he has
T NessTheHer> But it won't help him because Uru got a point to counter it
T NessTheHer> So he wasn't advantaged in any way
T      Jhang> Bleeeeeh
T      Jhang> Poor Lex
T      Jhang> It's times like these That I am happy to be on your team.
  NessTheHer> 10 minutes remaining
  NessTheHer> Score: 3- 13
  NessTheHer> Uru
T      Jhang> So, how long has Uru been a Warbird Pilot?
       Lex24> HAX!
    UrutoraD> lawls
  Need help with Trench Wars? Type ?help (question), and a staff member will get back to you when one is available.
       Lex24> DAMN
T NessTheHer> You lag, Uru
T NessTheHer> Which means you SUCK
T      Jhang>  Oh Ho!
T      Jhang>  Wait, I shouldn't be laughing about that
  Next elimination match is starting. Type ?go baseelim to play
T NessTheHer> This match isn't that terrible
T      Jhang>  Unlike mine >>
T NessTheHer> Uru beat the shit out of a guy named Redeal once
T NessTheHer> Complete shut out
T      Jhang>  How much time left?
  NessTheHer> 5 minutes remaining
  NessTheHer> Score: 5 - 31
  NessTheHer> Uru
       Lex24> FAIL
T NessTheHer> This is like . . . war of the lag
    UrutoraD> :O
T      Jhang> Wooo
T      Jhang>  He got a kill?
T protoman_1> omg phail
T      Jhang>  WHy are they ramming each over?
T protoman_1> I think Lex may be able to come back from this one.
T protoman_1> Like, NEVER.
T NessTheHer> If he scores a billion points in less than 2 minutes
T protoman_1> OMG
T      Jhang>  If he was Chuck Norris, that is possible!
T protoman_1> LEX KILLED HIM!
T      Jhang> Oh no!
  Next elimination match is starting. Type ?go elim to play
T protoman_1> He tried to spawn kill omgz
T      Jhang>  He is channeling the soul of Chuck Norris!
T      Jhang>  See?
T protoman_1> Nope.
T NessTheHer> At least this isn't a total murder
T NessTheHer> LEx got SOME kills
T      Jhang>  XD
T protoman_1> You mean like me and Striker? >_>
T      Jhang>  What is that, Triple Kill now?
T      Jhang>  Uh oh.
T      Jhang>  Looks like the spirit of Carrot Top now
  NessTheHer> 1 minute left
T protoman_1> 11 to 39 lawls
T protoman_1> Make it 50!
T protoman_1> Come on, Uru!
T protoman_1> NO!
T protoman_1> KEEP IT AT 42!!!
  NessTheHer> HALT!!!
       Jhang> Hammer time?
  NessTheHer> This match is over!
  NessTheHer> The winner is Uru
  protoman_1> Wasn't it over like, 10 minutes ago?
    UrutoraD> ADRIAN!
  NessTheHer> Final Score: 11 - 42
       Jhang> Hey!
  NessTheHer> Any last words from anyone?
    UrutoraD> AAAAAAAAAAAAAAAAAAAAADDDDRRRRRRRRRRRRRRRRRRRRRRIIIIIIIIIIIIIAAAAAAAAAAAN
       Jhang> He got more points than Striker did!
  NessTheHer> Indeed
  NessTheHer> Okay
  NessTheHer> Log done
  protoman_1> L:Awlz
