  Log file open: tjvsblade
  NessTheHer> ?chat
  Welcome To Trench Wars. http://www.trenchwars.org
  Welcome To Trench Wars. http://www.trenchwars.org
  helmut: Cuddy,T.J.,MagnusRage0,NessTheHero
  starmen: NessTheHero
C 1:MagnusRage0> lolz 2 #bngwars
  NessTheHer> Give me a sec to get my watch
  MagnusRage> So Ness, I'm assuming you're judging?
  NessTheHer> yeah
C 1:Cuddy> lolol k
  Next elimination match is starting. Type ?go elim to play
  NessTheHer> Is this you vs blade?
C 1:T.J.> i r t3h practice
C 1:Cuddy> onoz
  MagnusRage> No, T.J vs Blade.
  NessTheHer> oh
  MagnusRage> T.J.'s "practicing"
  NessTheHer> ok
  MagnusRage> n00b
       Cuddy> ?
       Cuddy> wtf?
  MagnusRage> Now I'm free to commentate without responsibilities!
  MagnusRage> What?
  MagnusRage> WHAT TROUBLES YOU, PADAWAN?!
       Cuddy> sex.
       Cuddy> I find your lack of sex disturbing, or something.
    UrutoraD> your mom
  Next elimination match is starting. Type ?go baseelim to play
  MagnusRage> lawlz
       Cuddy> quiet j00
C 1:MagnusRage0> Where be the fighters?!
       Cuddy> lolzor uru, talk to blade about mage inbalances
C 1:T.J.> i r practicecoptering
       Cuddy> e thinks they're overpowered
    UrutoraD> roffle
C 1:Cuddy> u suk
    UrutoraD> Why?
C 1:Blade_Serpent> no u
    UrutoraD> Mages suck
       Cuddy> someone kill me while we wait
    UrutoraD> You're crazy, Blade
C 1:T.J.> ur mom
       Cuddy> arg, packet loss
  Blade_Serp> I'm lagging for some reason
  Blade_Serp> Hang on
       Cuddy> oh, it's you
C 1:MagnusRage0> Hurry up, we actually kinda have a crowd.
C 1:MagnusRage0> Of 4.
       Cuddy> ahaha
    UrutoraD> How can you say Mages are overpowered?
  Blade_Serp> They can kill in like 3 attacks
    UrutoraD> n00b
C 1:T.J.> bite meh
C 1:T.J.> Alright, I'm comin
C 1:Blade_Serpent> wtf. 300 ping
C 1:Blade_Serpent> That should not be
       Cuddy> lgazor
       Cuddy> lololol
  Blade_Serp> wtf
        T.J.> omg 50 lagz
       Cuddy> lawl
  Blade_Serp> arg
  Blade_Serp> wtf
        T.J.> Poor Blade
        T.J.> You should forfeit
  Blade_Serp> Oh well. 300 is... ok...
       Cuddy> um...
    UrutoraD> If you're on dial-up
    UrutoraD> lololololol
       Cuddy> XD
  Blade_Serp> Bite me boy.
  Blade_Serp> Anywas, bosspeoples. I'm set.
        T.J.> I suppose I'm ready as well
T   UrutoraD> I VOTE ON ME
  Blade_Serp> Cuddy needs to - yea
       Cuddy> :P
  Blade_Serp> Use TJ's score column, guys
  Blade_Serp> Mine is off
        T.J.> I gots me thin mints and iced tea
    UrutoraD> laggot
    UrutoraD> Stop eating
       Cuddy> XDXD
       Cuddy> omgz eatar
  Blade_Serp> Why are Cuddy and Magnus on a different squad? o.O
        T.J.> O.o
       Cuddy> ecause we're TWD
    UrutoraD> :O
        T.J.> What Squad is Cuddy on?
       Cuddy> caus we rock
    UrutoraD> TWD is different
  Blade_Serp> It's SquadBnG instead of BnG
    UrutoraD> RIRIRIRRIIR
  MagnusRage> I'm trying to make a TWD team again.
  Blade_Serp> But whatevah
  Blade_Serp> Losers.
        T.J.> Ah
    UrutoraD> gtfo
        T.J.> Okay
       Cuddy> :P
  Blade_Serp> Yea, with like 4 of you? Good luck.
  MagnusRage> YOU SHOULD ALL JOIN.
  NessTheHer> okay, I'm rdy
  MagnusRage> Actually, 2 of us.
  Blade_Serp> I'm set too
T MagnusRage> omg team chat
       Cuddy> yeah, you could join yourself, scott :P
        T.J.> omg they inv4de r rom lozzle
  NessTheHer> Contenders to opposing safes
T   UrutoraD> Go back to BnG
  Blade_Serp> lready there
  NessTheHer> okay
        T.J.> Way ahead of ya Ness
    UrutoraD> Gogogo
  NessTheHer> Fighters ready?
  Blade_Serp> YES
T      Cuddy> no
        T.J.> Ready like pancakes and syrup
  NessTheHer> GO!
T   UrutoraD> WHO WINS!?!?!?!?!?!?!?!??????????????????????!?!!!!!!!
T      Cuddy> god does
        T.J.> Meep
T MagnusRage> lawlz
T   UrutoraD> Whoever wins, still loses
T      Cuddy> omfg lag
        T.J.> Sonuva
  Blade_Serp> ez
T NessTheHer> Ugh, blade has tainted his scoreboard
        T.J.> ur mom is exz
T NessTheHer> Goddammit
T NessTheHer> I'll have to go off TJ's
T MagnusRage> Uru, if you can tell me the squad name and password again, I shall return. XD
T      Cuddy> isn't saying ez some rule violation?
T   UrutoraD> Ask GB for the password
T NessTheHer> no
T      Cuddy> onoz
T   UrutoraD> Soooooooo boring
T MagnusRage> Eh, Geebs said the new thing was fine.
  Blade_Serp> Shit
T MagnusRage> lolz they n00bs
        T.J.> bizatch
  Blade_Serp> Nice
T   UrutoraD> Bout time
        T.J.> Sanks
T   UrutoraD> LEARN TO AIM
        T.J.> Carp
T      Cuddy> XD
T      Cuddy> scott didn't even shoot on my screen
T      Cuddy> TJ just died
T   UrutoraD> roffle
T NessTheHer> cuz u lag
T   UrutoraD> Nope
T NessTheHer> yep
T   UrutoraD> Blade is on dial-up
        T.J.> O.o;
T NessTheHer> ew
T      Cuddy> lawl
T   UrutoraD> what a n00b!
        T.J.> You totally shot through a rock
  Blade_Serp> Lies
T NessTheHer> who has dialup anymore? n00blet
T      Cuddy> laghax
T   UrutoraD> Blade does
T NessTheHer> get with the future
        T.J.> Okay, that was just bad on my part
  Blade_Serp> Yep
T      Cuddy> poor people in aus do
T      Cuddy> lawl
T NessTheHer> dialup should be outlawed
T      Cuddy> XD
T   UrutoraD> I remember when I joined the squad :O
  Blade_Serp> Eaaattt
        T.J.> That was better
T   UrutoraD> I had dial-up then
  Blade_Serp> Shit
        T.J.> wewt
T      Cuddy> lawl nub
  Blade_Serp> We're both rusty XD
  Blade_Serp> rgsafvaerjvn
T      Cuddy> I didn't join till I got broadband
  Blade_Serp> Ok, I am anyway
T   UrutoraD> stfu TGPGPGPGPGPGPPGGPG n00b
        T.J.> XD
T      Cuddy> which is shit broadband, lawl
T   UrutoraD> lawls
        T.J.> Yar, fell into that one
T   UrutoraD> So
  Blade_Serp> Yep
        T.J.> XD
  Blade_Serp> Hehe
  Blade_Serp> BOOM
T   UrutoraD> Hm
  Blade_Serp> Shit
T      Cuddy> XD
        T.J.> D'oh
T      Cuddy> TJ looked at blade and he died
        T.J.> What was I thinking?
T   UrutoraD> I SHOULD CHALLENGE MADARROWOWOWOWOWO
  Blade_Serp> No clue
T      Cuddy> but he's dead
  NessTheHer> 10 Minutes left
  NessTheHer> Score: 7 - 6
  NessTheHer> Blade
T   UrutoraD> No one is dead until I say they are
  Blade_Serp> Ship change
        T.J.> onoz
T   UrutoraD> ew
T NessTheHer> Blade is definitely better in a lanc
T   UrutoraD> lanc = ez
        T.J.> roffle
T      Cuddy> lolz
T   UrutoraD> TJ, FLY BACKWARDS
T NessTheHer> The lanc has moderate firepower and rapid fire
T   UrutoraD> grah!
        T.J.> XD
T MagnusRage> The Lanc is the official n00b ship.
  Blade_Serp> Hehe
        T.J.> We're never gonna get anywhere
T MagnusRage> Even Weasel takes more skill.
T   UrutoraD> Lancs are easy pickins
T NessTheHer> ur the official n00b ship
T      Cuddy> wtf lag
        T.J.> I stand corrected
  Blade_Serp> What as that?
T      Cuddy> no it doesn't, magnus
T   UrutoraD> Why does he keep flying to him?
        T.J.> Okay, not cool
  Blade_Serp> :D
T MagnusRage> Because T.J. can't do radar shots?
  Blade_Serp> Ow
        T.J.> Cool
T NessTheHer> Yay!
T MagnusRage> lawlz
T      Cuddy> weasel is the pussy ship of the century, guranteed kill against any non-Xradar
T   UrutoraD> Terrs suck
T NessTheHer> Unless you miss
T MagnusRage> Pfft, no it's not. I've killed tons of Weasels with a WB.
T NessTheHer> Then  they see you and you die
T   UrutoraD> Because no one knows how to use them
T      Cuddy> if you miss, then you just suck
  Blade_Serp> Shitr
T   UrutoraD> Weasel is like a Rogue
T      Cuddy> quiet magnus, you're too good anyway
T   UrutoraD> roffle
  Blade_Serp> XD
T MagnusRage> All it takes is being smart to know if there's an x around, then go crazy.
        T.J.> Hoyl hax Batman
T      Cuddy> you can probably see them anyways lawl
T MagnusRage> Eventually they shoot, miss, and boom!
T   UrutoraD> Lanc shots are slow
T      Cuddy> dur
  Blade_Serp> Crap
T MagnusRage> lawlz
T MagnusRage> Go T.J.!
T   UrutoraD> Death to Lancs!
T MagnusRage> Amen brotha'!
T   UrutoraD> roffle
  Blade_Serp> :o
T   UrutoraD> Lancs suck everywhere but inbase
T MagnusRage> I will laugh if T.J gets to the final match.
        T.J.> XD
  Blade_Serp> We do that lots
T      Cuddy> XD
T   UrutoraD> Nevah!
T NessTheHer> I'll laugh if blade does
T MagnusRage> LAUGH UNTIL I CRY.
T      Cuddy> ness, whut bez the time?
T   UrutoraD> Nevah!
T NessTheHer> Because he denied the tournament ever ending
T NessTheHer> almost 5 min left
T MagnusRage> That would be hysterically ironic.
T   UrutoraD> Proto is probably gonna be a finalist
        T.J.> D'oh
        T.J.> I gambled
  Blade_Serp> Missed me
T MagnusRage> Heck no! I'm killing Proto this round. >=O
T   UrutoraD> pft
  NessTheHer> 5 minutes left
T      Cuddy> do I need to get the uru and proto dolls out again? lawl
  NessTheHer> Score 14 - 13
  NessTheHer> TJ
T   UrutoraD> Sorry, but proto is one of the godly playes :O
T NessTheHer> He said you SUCK Magnus
        T.J.> Damn!
T   UrutoraD> zomg eat
        T.J.> I swear that was gonna hit you
T MagnusRage> omg wat?!?!
  Next elimination match is starting. Type ?go baseelim to play
  Blade_Serp> Even again
T   UrutoraD> I say TJ is winning
        T.J.> Eatz
T   UrutoraD> Cause that's what my screen says
T MagnusRage> omg eatz
  Blade_Serp> Missed
T   UrutoraD> Not anymore
T   UrutoraD> roffle
  Blade_Serp> Crap
T MagnusRage> ruffles
T   UrutoraD> oh ya
        T.J.> Eatz
T      Cuddy> lawl.
        T.J.> Eatz lead
T NessTheHer> This will be a close match
        T.J.> Tnoe to self
T   UrutoraD> What was that?
        T.J.> No more typing
  Blade_Serp> XD
T   UrutoraD> foo
T MagnusRage> ... Retard. XD
  Blade_Serp> DAMN
T   UrutoraD> owned
T MagnusRage> oh dang, doo'!
T NessTheHer> Close as HELL match
T   UrutoraD> nope
T      Cuddy> hax
T   UrutoraD> Hell is far
T      Cuddy> not for you
T MagnusRage> lawlz oxymoron
T   UrutoraD> I was kicked out of hell
T      Cuddy> lawls
T   UrutoraD> onoz
        T.J.> Bass
  Happy Pi Day. ?go trivia -Ikrit
T MagnusRage> T.J = t3h loze
T   UrutoraD> If Blade wins, I must kill Mad >:O
  Blade_Serp> Shit
        T.J.> head shot
T   UrutoraD> If Blade loses, I must kill Mad >:O
        T.J.> Sonuva
  Blade_Serp> Hi thar
  NessTheHer> One minute remaining
  NessTheHer> Score: 18 - 20
  NessTheHer> Blade
        T.J.> I are lose
T MagnusRage> No matter what, Proto dies.
T MagnusRage> I MUSS WEEN.
  Blade_Serp> Eeek
T   UrutoraD> Go left!
T MagnusRage> RUNNER!
T MagnusRage> Stupid jerk.
  Blade_Serp> NICE
T MagnusRage> He's being like Lucon.
T   UrutoraD> ouch
  Next elimination match is starting. Type ?go elim to play
  NessTheHer> HALT!
  Blade_Serp> Phew
  NessTheHer> The match is over!
        T.J.> One point short I bet
  Blade_Serp> Think so
  NessTheHer> The winner is Blade!
T   UrutoraD> Except Lucon is mean
        T.J.> Thought so
    UrutoraD> onoz
  Blade_Serp> Good match, TJ :D
  NessTheHer> Score: 21 - 20
        T.J.> Twas =D
  Blade_Serp> VERY good
       Cuddy> .hax
    UrutoraD> Blade, call Mad :O
  NessTheHer> That match was CLOSE AS HELL
T MagnusRage> Yes. And ran far, far away so I couldn't beat him.
  NessTheHer> Any last words?
  MagnusRage> Yes it was.
  Blade_Serp> Yes, it was.
        T.J.> I'd be mad, but it was beyond shibby
  MagnusRage> OH DANG BEAT YOU TO IT.
        T.J.> I got one!
  Blade_Serp> Last words?
        T.J.> XD
  Blade_Serp> THAT
  Blade_Serp> XD
       Cuddy> XDXD
  Blade_Serp> Same idea
    UrutoraD> Call Mad!
  Blade_Serp> Umm
  NessTheHer> okay, log closing
  Blade_Serp> Ok
       Cuddy> call the ghost busters!
