  Log file open: JhangVsMidnight
        T.J.> Log open
  Front Line> Hah
  Blade_Serp> Onoz log
        T.J.> Cause I'm timing with a watch =P
  Blade_Serp> XD
        T.J.> Not s stopwatch
  Front Line> Madarrow finally shows up
  Blade_Serp> He shows up when I summon him
        T.J.> OKay, ready?
  Front Line> Yeah
  Blade_Serp> Yep
        T.J.> FIGHT!
T       T.J.> Heydeho Mad
T   Madarrow> Good
T       T.J.> Jhang in a Terr
T       T.J.> This should be interesting
  Blade_Serp> ...
  Blade_Serp> -_-
  Blade_Serp> See, you eat
T   Madarrow> I vote on Blade...
        T.J.> Just a reminder Jhang, no portals or bursts
  Front Line> Wait, what?
  Need help with Trench Wars? Type ?help (question), and a staff member will get back to you when one is available.
  Front Line> I can Burst
  Front Line> Rule 6 staes I can
  Blade_Serp> Yea
        T.J.> Oh, go ahead then XD
  Blade_Serp> He can
  Blade_Serp> :p
  Blade_Serp> Eat again
T       T.J.> He does eat...but what can ya do about it?
        T.J.> Continue fighting
        T.J.> If you get specced Jhang, you can return to the game without penalty
  Blade_Serp> Eat again
T       T.J.> This is....anti climactic XD
  Blade_Serp> EAT
T   Madarrow> Jhang's eating EVERYTHING!
T       T.J.> Yes, I've noticed
  Blade_Serp> ND AGAIN
T   Madarrow> That should count as a kill.
T       T.J.> That one looked like a miss to me
T       T.J.> Besides, the guy's fighting in a Terrier
  Blade_Serp> Eat again..
        T.J.> TEN MINUTES REMAINING
        T.J.> SCORE: Blade - 2  Jhang - 3
  Blade_Serp> Should be like 7 -3
  Blade_Serp> Finally.
T       T.J.> And Poland should've been left alone throughout European history, what do yawant me to do?
T   Madarrow> Make judges earn their keep
T   Madarrow> You watch and see witch ones hit..
  Blade_Serp> Eat
T       T.J.> The great and mighty Ness has made no rulings on lag. We can discuss the issue with him afterwards
T       T.J.> And if neccesary, fight again
  Next elimination match is starting. Type ?go elim to play
T       T.J.> You can't really blame Jhang though. It's not his fault his connection sucks
  Blade_Serp> EAT
T       T.J.> Does he have that on macro?
  Blade_Serp> Score?
T   Madarrow> So, we all have to suffer because he lags?
T       T.J.> For now, yeah >>;
        T.J.> In a minute Blade
        T.J.> FIVE MINUTES REMAINING
        T.J.> SCORE: Blade - 5  Jhang - 3
  Blade_Serp> 2 eats
  Next elimination match is starting. Type ?go baseelim to play
T   Madarrow> XD
  Blade_Serp> The times I DO kil
  Blade_Serp> I'm not even close to him
T   Madarrow> That was WAY off to the side.
T       T.J.> Well, he misses when he htis and he hits when he misses. Balances out =P
  Blade_Serp> 2 more eats
T       T.J.> I am surprised he's only been specced twice
        T.J.> ONE MINUTE REMAINING
  Blade_Serp> hey, I actually hit him
  Blade_Serp> nd he died
  Blade_Serp> Holy crap
        T.J.> MATCH OVER
  Blade_Serp> Got the hang of lag-shooting you
  Blade_Serp> Then it was all over
  Front Line> Yeah
  Blade_Serp> What was the score?
        T.J.> END SCORE: Blade - 11  Jhang - 4
        T.J.> The winner is Blade!
        T.J.> Or Midnight!
  Front Line> Terr cannot beat Warbird unless it counters
  Blade_Serp> Mkay... Actual score was like 19 - 4
        T.J.> Whoever he is!
  Front Line> Pfft.
  Front Line> Stop whining about Lag shots
  Blade_Serp> With my eats counted
        T.J.> Score was 11-4, end of story =P
  Front Line> Remember, It works both ways
  Blade_Serp> I know
  Blade_Serp> nyways, see ya
  Front Line> On my end, everyone else lags
        T.J.> Good jog though Jhang
  Front Line> Yeah yeah,
        T.J.> *job
        T.J.> You had him for the first half
  Front Line> If I could play smart instead of stupid,
  Front Line> I would have won.
        T.J.> Well, lesson learned
  Front Line> Yes.
        T.J.> If it's any consolation, I was rooting for you
  Front Line> Whenever I know my own weaknesses,
  Front Line> Compensation doesn't matter
        T.J.> He left. Well...uh...log closed then
