  Log file open: magnusvscuddy
  NessTheHer> ?chat
  Welcome To Trench Wars. http://www.trenchwars.org
  Welcome To Trench Wars. http://www.trenchwars.org
  helmut: Cuddy,MagnusRage0,NessTheHero
  starmen: NessTheHero
    bobinson> ns
  Wacky Lady> lol
       gh789> lol
     efeatay> ty
C 1:MagnusRage0> oh em gee!
C 1:Cuddy> hax
  NessTheHer> Wow, there is nobody here
  NessTheHer> So I must commentate myself
  MagnusRage> Yeah.
  NessTheHer> Alright
  MagnusRage> Me and Cuddy found the BEST time for a match.
  NessTheHer> Contenders to opposing safes
  MagnusRage> You know. For a big crowd. lawlz
       Cuddy> erm
       Cuddy> I said I'd tell forai when we started
       Cuddy> so he'll be here
  NessTheHer> We'll start anyway
       Forai> lawl
  MagnusRage> lolz!@
       Forai> oh wait
       Cuddy> ok, I need to know something
       Forai> cuddy vs magnus?
T NessTheHer> Team chat only plz
  MagnusRage> For sho'!
T      Forai> ok
  NessTheHer> Know what, Cuddy?
       Cuddy> where exactly are the boundaries?
       Cuddy> I'm confused.
  NessTheHer> The 3 safes and base form a square
       Cuddy> more of a diamond
  NessTheHer> Square
  NessTheHer> Don't count the small ones
       Cuddy> or a kite
       Cuddy> huh?
  MagnusRage> This will be either awesome or disasterous for me. Let us find out!
       Cuddy> lolz
  MagnusRage> Rar!
       Cuddy> wut u fly, magnus?
       Cuddy> wb?
  MagnusRage> lolz u jus hav 2 wiat
       Cuddy> u suk
  MagnusRage> ruffles
       Cuddy> :(
  NessTheHer> okay
  NessTheHer> Fighters ready?
       Cuddy> urgh, 15 mins of this
       Cuddy> sure
  MagnusRage> Aye!
  NessTheHer> Okay
  NessTheHer> You have 15 minutes
  NessTheHer> GO
T NessTheHer> hooray match
T NessTheHer> yawn
T NessTheHer> Cuddy is in a spider
T NessTheHer> Magnus is in something
T NessTheHer> a warbird
T NessTheHer> hooray
T NessTheHer> My brother is watching Nickelodeon
T NessTheHer> What is up with that
  MagnusRage> onoz
T NessTheHer> I mean, Nick has terrible programming now
  MagnusRage> Wrong one
T NessTheHer> Stupid crappy shows with real people who are bad actors
T NessTheHer> I liked old nick though
T NessTheHer> Pete and Pete was awesome
T NessTheHer> Did you like pete and pete TexBot?
T NessTheHer> ANSWER ME
T NessTheHer> Oh, yeah, he's not here
T NessTheHer> Everyone go to Taco Bell
T      Forai> I LIKE TACO BELL
T NessTheHer> Because in the future, every restaurant is Taco Bell
T      Forai> :D
T      Forai> ooh, cuddy took a hard one there ;..;
T NessTheHer> A mikes Hard Lemonade
T NessTheHer> Available for 2.99 a bottle at your local bar
T NessTheHer> *is paid a large sum of cash*
T NessTheHer> Cuddy is getting wtfpwned
T      Forai> 39 and a half foot bar, as seen in "the grinch stole christmas" available at 3d8 to your money roll
  MagnusRage> Curses!
T      Forai> he's not dodging enough
T NessTheHer> And this next CD is from David Bowie. Dance Magic Dance
  NessTheHer> 10 minutes left
  Next elimination match is starting. Type ?go elim to play
  NessTheHer> Score: 4 - 9
  NessTheHer> Magnus
T      Forai> remember, David bowie does not get you in to the same events as if it was a bow tie...
T NessTheHer> Yes, but he is the goblin king
T      Forai> none shall pass?
T NessTheHer> Or they shall die
T NessTheHer> Black Knight Security Services
T NessTheHer> Call us, today!
T      Forai> Monty python's?
T NessTheHer> *stabs Forai*
T      Forai> I've been hacking alot recently
T      Forai> my lungs hurt now ;.;
T NessTheHer> Suck it up
T      Forai> my throat itches!
T      Forai> oh well
T NessTheHer> Eat some insulation
T NessTheHer> It's cotton candy!
T      Forai> :D it tastes like PAIN
T      Forai> where can I buy it?
  MagnusRage> omg eatz
  NessTheHer> 5 minutes left
  NessTheHer> Score: 7 - 16
  NessTheHer> Magnus
T      Forai> ... anyway
T      Forai> cuddy should be ripposting more
T NessTheHer> My score is 3567
T NessTheHer> I am actually winning this match
T      Forai> Waiwha?
T      Forai> ... Chuck norris is really winning this match
T      Forai> 'cause he could roundhouse kick the server 20 times in a row... killing everyone in it :D
       Cuddy> lawl
  MagnusRage> rouffle
T      Forai> ooh, another doublekill
T NessTheHer> Chuck Norris simply thinks of the server, and he wins
T      Forai> yep
T      Forai> Magnus wallhax
T      Forai> :o
T NessTheHer> u lie
T      Forai> YOU wall hax :O
T NessTheHer> I hax walls
T      Forai> chuck norris hacks walls... and by hack I mean roundhousekick
  NessTheHer> 1 minute left
       Cuddy> lolz
  MagnusRage> ruffles
  NessTheHer> Score: 16 - 23
  NessTheHer> Magnus
       Cuddy> XD
  MagnusRage> Yay!
T NessTheHer> And by walls, you mean babies
T      Forai>  yep
  TWBD Tourny: Dice vs Juice at ?go twlb 
  NessTheHer> STOP
  TWBD Tourny: Pandora vs Sk8 at ?go twlb2 
       Forai> COLLABORATE AND LISTEN
  TWBD Tourny: Syndicate vs Ancients at ?go base 
       Cuddy> sex
  NessTheHer> The winner is Magnus
  TWBD Tourny: Anti-Scrub vs -Final- at ?go twlb3 
  NessTheHer> So there
  MagnusRage> w00t!
       Cuddy> lawl
  NessTheHer> Score: 25 - 19
       Cuddy> onoz
  NessTheHer> yep
  NessTheHer> Cuddy phails
  MagnusRage> Can I go now?
  NessTheHer> NO
  NessTheHer> That was part 1
  MagnusRage> Now that I've crushed the hopes of a young boy?
  NessTheHer> There are 300 more parts
       Forai> part one?
       Forai> :O
  MagnusRage> oh em gee!
  To report cheaters and teamkillers to moderators type ?cheater cheater name, what he is doing
       Forai> so I can't kill people? ;.;
  NessTheHer> Part 2 is 70 minutes long
  MagnusRage> Cuddy's gonna transform!
       Cuddy> u suk
  NessTheHer> Yeah you're done
  MagnusRage> Into his most powerful form!
  NessTheHer> Log over
