  Log file open: madvsmew
       Cuddy> log open.
    Mewtroid> In position
    Mewtroid> What is that bell sound?
  Blade_Serp> Ok, you both ready??
    Madarrow> Yeah
  Blade_Serp> Mewtroid? Ready?
    Mewtroid> yeh
  Blade_Serp> Ok then!
  Blade_Serp> On 3!
    Mewtroid> Although I wish somebody would identify the bell sound
  Blade_Serp> 1
  Blade_Serp> 2
  Blade_Serp> 3!
       Cuddy> GOGOGOO
  Blade_Serp> GO GO GO
    Mewtroid> OW
T Blade_Serp> FIRST BLOOD
    Mewtroid> did I just die again?
       Cuddy> um, yeah.
  Blade_Serp> Yes.
    Mewtroid> my computer alt-tabbed on me by itself
  Blade_Serp> Stop typing in the fight
    Mewtroid> ow
    Madarrow> Switching ships
    Mewtroid> ^*^*#
T Blade_Serp> For those of you reading the log
T Blade_Serp> We're chatting on vent
T Blade_Serp> So this is a really boring log
    Madarrow> NO!
T Blade_Serp> Haha, Mad got pwned
T Blade_Serp> For the first time
    Mewtroid> large target ^.^
T Blade_Serp> :O and again
T Blade_Serp> And mad changes back to WB
    Madarrow> There
T Blade_Serp> Cause he blows at Lancs
    Mewtroid> uhoh
T Blade_Serp> :O
  Blade_Serp> 10 MINUTES REMAINING
  Blade_Serp> SCORE: Madarrow 7, Mewtroid 4
T Blade_Serp> Mewtroid is turning this around a bit...
T Blade_Serp> I think Mad is just getting overconfidant
    Madarrow> That's more like it
T Blade_Serp> :O
T Blade_Serp> Maybe this kid IS semi-decent
  Next elimination match is starting. Type ?go baseelim to play
T Blade_Serp> Mewtroid tries to camp
T Blade_Serp> Mad pwns
T Blade_Serp> DOUBLE KILL
T Blade_Serp> Like, continuum terms. Not the UT one
    Mewtroid> owiz
T Blade_Serp> HE SHOOTS! HE SCORES
  Trivia is starting. Type ?go trivia to play - Mantra-Slider 
  Next elimination match is starting. Type ?go elim to play
  Blade_Serp> 5 MINUTES REMAINING
  Blade_Serp> SCORE: Madarrow 13, Mewtroid 8
  Blade_Serp> MAKE THAT MADARROW 14
T Blade_Serp> DOUBLE KILL
T Blade_Serp> HEADSHOT
T Blade_Serp> Translation: Mad pulled off a radar snipe
  The Gauntlets of Gatez are open for your pleasure ?go gatez2 to play -LMAO
  Blade_Serp> 2 MINUTES REMAINING
  Blade_Serp> SCORE: MADARROW 18, MEWTROID 10
  Blade_Serp> MAKE THAT 19 FOR MAD
T Blade_Serp> OH HO
    Mewtroid> WARP!
  Blade_Serp> Ship change
T Blade_Serp> Mad switches to Weasel
    Mewtroid> OW!
    Mewtroid> HOW CAN SOMETHING SO SMALL HURT SO MUCH!?
  Blade_Serp> 1 MINUTE REMAINING
  Blade_Serp> SCORE: 20 - 11, MADARROW LEADING
  Blade_Serp> 30 SECONDS
  Blade_Serp> STOP!
  Blade_Serp> MATCH OVER
       Cuddy> STOP
  Blade_Serp> WINNER: MADARROW
  Blade_Serp> SCORE: 22-11
    Mewtroid> NOT STOPPING I MUST CONTINUE THE FIGHT!
       Cuddy> shaddap. you're done
       Cuddy> lolo.
    Mewtroid> EVEN IF THE MATCH IS OVER
    Madarrow> XD
