  Log file open: tourneyDevinProto
T  Dragonblade> who do you think will win? :O
   NessTheHero> Log opened
  protoman_116> Me, neither...
         Devin> but I suppose I'll have ta
T  NessTheHero> Maybe Devin
         Devin> let's get this party started
  protoman_116> I need to go to the bathroom... :P
T  Dragonblade> I bet on Devin too...
T  Dragonblade> He's done good in the previous 2 matches...
T  Dragonblade> I got so raped, though...
T  NessTheHero> He'll be 1337 if he wins this match
T  Dragonblade> Very 1337
  protoman_116> OK!  Bladder emptied and READY to START THIS PARTAY!
   NessTheHero> Fighters ready to partay?
         Devin> eh...
         Devin> ready as I'll evar be
  protoman_116> Ready to Partay.
   NessTheHero> Lets get this funkay frash thang started!
  protoman_116> ...
  protoman_116> go?
         Devin> that a go?
   NessTheHero> GO!!!!!!!!!!
T  Dragonblade> :O
         Devin> that a roger Roger
T  NessTheHero> YAY DEVIN!!!!!
T  NessTheHero> GO DEVIN
T  NessTheHero> BEAT HIS ASS!!!
T  Dragonblade> I bet 500 elephants on Devin.
T  NessTheHero> I bet ten pounds of Pocket lint
  protoman_116> ...
  protoman_116> Doo doo doo...
T  Dragonblade> Where's proto?
  More hunt come play ?go javufc -JDM37 <ER>
   NessTheHero> Um, ACTUALLY FIGHT!!!
         Devin> waitin..
  protoman_116> Hello?
         Devin> whered he go? 
T  Dragonblade> OMG WTF BOXER SHORTS HELLO KITTY!
T  NessTheHero> Wuss
         Devin> OMG Coward
T  Dragonblade> potatoman116 is just hiding...
         Devin> heh
T  Dragonblade> Yes, I said potato on purpose
  protoman_116> I'm playing defense
  protoman_116> damnit
T  Dragonblade> er... I just realized the log is on...
  protoman_116> I hateyou!
T  NessTheHero> omfg potato
  protoman_116> :P
T  Dragonblade> No offense or anything, proto...
T  NessTheHero> Yes, he'll see this and shoot you
T  NessTheHero> KILL HIM PROTO
T  Dragonblade> just a little harmless humor... heh heh... :(
T  NessTheHero> Start writing your will
T  Dragonblade> ...I'm dead, aren't I?
  protoman_116> time?
   NessTheHero> 11:00
T  Dragonblade> :O
  protoman_116> damn... 4 minutes and only 3 kills.
         Devin> yeah...
T  Dragonblade> They aren't bloodly beating the BANANA out of each other yet...
T  NessTheHero> GET A LEV AND BLOW SHIT UP!!!
T  Dragonblade> And for anyone reading this, I said Banana of my own account...
T  NessTheHero> lol . . . BANANA!!!!
T  Dragonblade> so HA
T  NessTheHero> BANANA!!!!!!
T  Dragonblade> OMG WTF BANANA SHORTS LAWL
T  NessTheHero> APPLES AND BANANAS!!!
T  Dragonblade> And... KIWIS
         Devin> screen froze O_o
  protoman_116> damn
  Next elimination match is starting. Type ?go baseelim to play
T  Dragonblade> We are all a happy faaaaamily! o/~
  protoman_116> time?
   NessTheHero> 9:00
   NessTheHero> One of you FREAKING DIE ALREADY!!
  protoman_116> hehehe
         Devin> I'm winning right?
  protoman_116> yep
   NessTheHero> Yes, BY ONE!!
T  Dragonblade> "Why hello, Mrs.Kiwi." "Oh.. Mr.Apple... I... didn't see you there..."
         Devin> if he is too chicken to fight me whu not let him lose in hiding :P
  protoman_116> I
T  Dragonblade> "Make love to me, Mrs. Kiwi..." "Take me, Mr.Apple!"
  protoman_116> will.
  protoman_116> kill
  protoman_116> you
T  Dragonblade> XD
   NessTheHero> Actually, its called a defensive strategy
         Devin> bout time
         Devin> now this is fun
T  Dragonblade> And THAT is how little Banana was created!
T  Dragonblade> XD
T  NessTheHero> o.O
  protoman_116> hah
         Devin> O_o
  protoman_116> NOW HIDE!
         Devin> it missed and I blew up?
   NessTheHero> Wait, someone died?
  protoman_116> Devin
  protoman_116> 3-2
  protoman_116> me win
  protoman_116> ing^
T  Dragonblade> I have an overactive imagination sometimes...
  protoman_116> Time?
         Devin> screen is freezing on me O_o
   NessTheHero> 5:45
         Devin> all ships other than cloak are fine right?
  protoman_116> Defense Defense Defense!
   NessTheHero> Yes
T  Dragonblade> What's Devin planning?
  protoman_116> heh
T  Dragonblade> LEVI?!?!?
T  Dragonblade> He's desprate..
  protoman_116> Levi
T  Dragonblade> wait, he changed
         Devin> bah..
T  Dragonblade> Go Devin, GO!
T  Dragonblade> Noo... He's losing..
         Devin> I suck...
         Devin> good game proto
  protoman_116> No, you just can't beat a Defense man'
  protoman_116> :P
T  Dragonblade> And it's a one man commentary! It's just Dragonblade making comments!
         Devin> I can't beat anyone :P
T  NessTheHero> :)
  protoman_116> Oh
  protoman_116> explain your last 2 wins :P
         Devin> I got lucky and everyone left
T  Dragonblade> He must be insane! No you aren't! Yes I am! No you aren't! Shhh... They'll hear you...
T  Dragonblade> XD
         Devin> every time I got to shoot!
T  NessTheHero> lol
         Devin> the screen freezes~! >L:o
         Devin> this sucks!
  protoman_116> doesn't it?
         Devin> yeah
T  Dragonblade> Aaaaaaanad the beat goes on and on... o/~
  protoman_116> nice levi
T  Dragonblade> Levi AGAIN?!?!?
T  Dragonblade> What is he thinking?
  protoman_116> nice Stealth
         Devin> was worth a shot
   NessTheHero> Stealth?
         Devin> forgot how to use this >.<
  protoman_116> just Radar
   NessTheHero> ah
  protoman_116> not Cloak
         Devin> time up?
   NessTheHero> No
   NessTheHero> 2:00
         Devin> was expecting reflectors but forgot it doesn't have em
         Devin> d'oh!
         Devin> I need to shut up. everytime I talk hesnipes me
  protoman_116> that was luck :P
         Devin> I lost because I talk. I suck cus I talk >;/
         Devin> 11-3?
  protoman_116> DON'T
   NessTheHero> 1:30
  protoman_116> 11-4
  protoman_116> 12-5
         Devin> carp..I gotta make a comeback
   NessTheHero> 10 - 6
  protoman_116> oh
T  Dragonblade> :O
  protoman_116> hide
  protoman_116> for a minute
         Devin> Ilost... I can;'t win...
   NessTheHero> :15
   NessTheHero> TIME!!!!!!!
  protoman_116> did that kill count?
T  Dragonblade> I'm HAPPY. I have no school tommarow. It got cancelled. Guess why...
   NessTheHero> Final score
         Devin> I was too burned out for 3 in a row. shoulda waited.
   NessTheHero> Proto: 12
         Devin> My mistake and I sucked because of it
   NessTheHero> Devin: 6
   NessTheHero> Log ending
  protoman_116> Nice game Devin
   NessTheHero> ?loh
