  Log file open: tourneySpearDevin
         Devin> tempted to change battle theme, but this edo remix is kinda cool.
         Devin> eh. I'll levae it as it is
   NessTheHero> Yay! People!
   Dragonblade> Hey guys
   Dragonblade> Hey!
   NessTheHero> Hey hey hey
         Devin> Hey dragon. scoping out the competition? :P
   Dragonblade> I can do my match after this!
         Devin> O_o
   Dragonblade> lol, I guess
   NessTheHero> Yeah, he can
   NessTheHero> lol
   NessTheHero> Sweet
   NessTheHero> Okay
   NessTheHero> ON MY MARK
   Dragonblade> I read the post in the forums and then came here...
         Devin> derned phone...
   NessTheHero> Pause
   Dragonblade> Gah, Gunbound is taking up way too much of my time lately...
         Devin> I'm going straight ta heck.
         Devin> Eh. Time for the match
   NessTheHero> Ready?
C 1:protoman_116> Shit, did I miss it?!
C 1:NessTheHero> No
C 1:MMXManiac> what?
C 1:Devin> miss what?
C 1:Dragonblade> nope!
C 1:Spearman> Not yet, it's about to start
C 1:NessTheHero> Get in here!
C 1:Dragonblade> come on!
         Devin> grat banner Nesss.
         Devin> Mr. Saturn :)
   NessTheHero> Thanks
   NessTheHero> I love it
   Dragonblade> Place your bets!
   NessTheHero> Ready?
  protoman_116> I almost missed it...
         Devin> no bets. >.<
   NessTheHero> Spec, team chat only
   NessTheHero> Well, ready?
         Devin> yeah yeah
      Spearman> Yes
C 1:MMXManiac> what's going on?
T protoman_116> Damnit, GB STILL didn't submit the map?
C 1:Spearman> Tournament match
C 1:Dragonblade> A match is happening
   NessTheHero> GO
T  Dragonblade> I bet on Devin...
C 1:MMXManiac> who can join?
T protoman_116> All my money... money... money... all my money, are be on Devin.
      Spearman> Booyaka! ^_^
         Devin> I'm not even going to get close am I
C 1:NessTheHero> Join what?
         Devin> bleh
C 1:MMXManiac> match?
T  Dragonblade> :O
C 1:MMXManiac> just devin and spear?
C 1:NessTheHero> You'll have to wait until next tourney
T  Dragonblade> Devin's getting keelhauled...
T protoman_116> Ar, me matey's!
T  Dragonblade> XXDF
         Devin> radar is glitchin O_o?
T protoman_116> Batton down the Hatches!
T  NessTheHero> Walk the plank, ye cold hearted knave!
T  Dragonblade> Swab the poop deck, mateys!
C 1:MMXManiac> maybe I should go to the forum once in a while
T protoman_116> Heheheh... Poop Deck
T  Dragonblade> XXD
T  Dragonblade> that's hilarious
T  NessTheHero> Oh god, this song rocks
T protoman_116> Why is it CALLED the poop deck?
         Devin> blah. I lost ;_;
T  Dragonblade> Cause... seagulls poop on it?
T  Dragonblade> I dunno
T  NessTheHero> o/~ I'm the king of the ring! o/~
T protoman_116> o/~ Come, on, Fhqwgads, I say come on Fhqwgads! o/~
      Spearman> Accursed multibullets x.x
         Devin> tied? O_o
T  NessTheHero> Tied
T  Dragonblade> XXD
T protoman_116> o/~ Everybody to the limit, everybody to the limit everybody come on Fhqwgads o/~
T  Dragonblade> o/` everybody to the limit, everybody to the limit, everybody to the limit come on! o/`
T  Dragonblade> Hey... we said the same thing..
T protoman_116> No, you said the WRONG thing :P
T  Dragonblade> Nuh uh, it was RIGHT
T protoman_116> I said the RIGHT thing :P
T  Dragonblade> ...well, you're just a mean ol poopy head. ;_; :P
T  NessTheHero> You trying to think that . . . You No Me!
T  Dragonblade> Are you logging this, Ness?
T  NessTheHero> Yes
T  Dragonblade> Ok
T  NessTheHero> I NEVAH FORGET!!!
T  Dragonblade> In that case, I'd like to make a shout out to my can of nestea...
   NessTheHero> 9:0 left
   NessTheHero> 9:20*
T protoman_116> Well, I'd like to make a shout out to...
T  NessTheHero> YO MOMMA!
T  Dragonblade> XXD
T  Dragonblade> lol
      Spearman> Boom!
         Devin> and spear takes the lead >.<
T  NessTheHero> Wait, there was a kill?
T  Dragonblade> yes..
T  Dragonblade> just now
T protoman_116> Karnak!  You kick that Tumors ASS!
T  NessTheHero> Spear?
T  NessTheHero> Must have been. He said boom
T  NessTheHero> Tied
T  Dragonblade> Oh, that's right, Karnak has a tumor... Get well soon, then..
T protoman_116> Oh, and a shout out to TinDante!
   NessTheHero> ?chat
  bobandgeorge: Spearman,Devin,NessTheHero,Dragonblade,protoman_116
T protoman_116> Make my Character cool!  Or I won't be your Fanboy no more :P
T  Dragonblade> Yay! Devin's winning! I think!
T  Dragonblade> XXD
T  NessTheHero> Yep
      Spearman> Crap
T  Dragonblade> brb, yo...
T protoman_116> I might win this bet!
T  NessTheHero> 400 million on the guy who wins
      Spearman> Quit running!
         Devin> :P
T protoman_116> $9999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999 on Devin
T  Dragonblade> I'm back..
T  Dragonblade> I betted nothing on Devin, just that he would win...
T  NessTheHero> You don't have that kind of money!
T protoman_116> Yes I have!
T  NessTheHero> Nuh uh!
T protoman_116> I have!
      Spearman> DAMNED MULTIFIRE!
T  Dragonblade> But now I'm placing... 5000 kilograms of sawdust on Devin
         Devin> lucky shot :P
T  Dragonblade> Yes, sawdust..
T  NessTheHero> He won't be able to move!
T protoman_116> A BAG OF PEANUTS!
T protoman_116> TO THE WINNER!
T  Dragonblade> And the rest of the peanuts gang! XXD
   NessTheHero> 5:00 left
      Spearman> Screw it. I forfeit
         Devin> O_o
T  Dragonblade> :O
   NessTheHero> Game over
T protoman_116> Time for something COMPLETELY Random
      Spearman> I'm out of practive
   NessTheHero> STOP
T  Dragonblade> He... forfeits!??!?!
         Devin> I am the winnar? O_o
  protoman_116> Don't stop the log!
  protoman_116> NOT YET!
   NessTheHero> Final score
   Dragonblade> MOO
   NessTheHero> Devin: 11
  protoman_116> MUST DO SOMETHING RANDOM FIRST!
  protoman_116> OMG HATS!
   NessTheHero> Spear: 4 billion
  protoman_116> WTF BOXER SHORTS!
         Devin> Devin 11?
   NessTheHero> j/
   NessTheHero> j/k
   Dragonblade> Hooray for macros!
   NessTheHero> Spear: 4
         Devin> I coulda sworn he got more than 4 O_o
   Dragonblade> stop...
   NessTheHero> Devin wins by forfeit
  Next elimination match is starting. Type ?go elim to play
   NessTheHero> Dragon, wanna do your match?
         Devin> I fight dragon now? O_o
   Dragonblade> Do I???
   Dragonblade> Yes
