  Log file open: tourneyDragonDevin
   Dragonblade> Change freqs, Devin...
         Devin> I wanted the lucky safe ;_;
         Devin> heh
   NessTheHero> I dunno Proto, check the thread
      Spearman> The reason I lost was because of those damned spreadshots =/
   NessTheHero> Players to their safes
   Dragonblade> Stop teh log! OMG!!!111oneoneone!
   NessTheHero> Why? I just started it
   Dragonblade> Oh..
   Dragonblade> I was talking bout the old onwe
   NessTheHero> Okay, READY?
   Dragonblade> Yes...
         Devin> sure why not
   NessTheHero> GO!!!!!!1!!!1one
T  NessTheHero> Spear, why did you get a spider?
T  NessTheHero> Spiders suck
T     Spearman> Multifire
T     Spearman> Hoping to kill him after he fired a shot at me
T  NessTheHero> Ah
T     Spearman> More like four actually, with the spread bullets
   Dragonblade> ...
   Dragonblade> NOOO
         Devin> O_o
   Dragonblade> flew right into that one
   Dragonblade> DAMN
   Dragonblade> Crap!
   Dragonblade> I'm rusty
   Dragonblade> CRAP
T  NessTheHero> I predict Devin to win
   Dragonblade> I haven't played in a while
   NessTheHero> Same with all of us
T     Spearman> I'm guessing you were wondering why I forfeited
T  NessTheHero> You were getting pwned?
   Dragonblade> Gunbound is taking up all my time...
T  NessTheHero> Gunbound < Continuum
  Another round of trivia will begin shortly! ?go trivia (hm, yeah.) ?go trivia -DoCk>
T     Spearman> 1. I was out of practice, 2. I had crap to do around the house, and 3. The multi bullets were pissing me off
   Dragonblade> NO
T protoman_116> Hey, Ness...
T  NessTheHero> Yeah?
   Dragonblade> 4-0...
   Dragonblade> DAMN
T protoman_116> It says I fight Blade Next, But I remember I already fought him and won
T protoman_116> Six was the judge
T  NessTheHero> I need the log
T protoman_116> DAMN YOU SIX!
   Dragonblade> CRAPIT
T protoman_116> So he Never sent the log?
T  NessTheHero> I'll check
T  NessTheHero> I might have it
T protoman_116> Who was there when I fought Blade?
T  NessTheHero> MIGHT have it
T  NessTheHero> I do remember Six sending me a log
   Dragonblade> time?
   NessTheHero> 10:30
   Dragonblade> NO
   Dragonblade> DAMN DAMN DAMN
   Dragonblade> Score?
   NessTheHero> 6 - 0
T protoman_116> So I may fight Devin Today?
   Dragonblade> CRAP
   Dragonblade> DAMNIT
T protoman_116> ToNIGHT^
T  NessTheHero> Is that how it will turn out?
T  NessTheHero> If he wins?
T protoman_116> yes
T  NessTheHero> Sure
T protoman_116> If you find that log
         Devin> nice
   Dragonblade> Finally!
   Dragonblade> :)
T protoman_116> Maybe we'll have to beat it outta six...
T  NessTheHero> I think I have it
T  NessTheHero> I just have to look for it
T protoman_116> ^_^
T  NessTheHero> It's deep in the caves of my PC
T     Spearman> Well, I'm heading off. So long
T protoman_116> You mean Bowels?
   Dragonblade> :OP
         Devin> bounced off a metoer
T  NessTheHero> No, my PC doesn't poop
   Dragonblade> XD
T protoman_116> Or DOES it?
   Dragonblade> Noooooo!
T  NessTheHero> I hope not
   Dragonblade> ACK
T protoman_116> When you go to sleep at night, IT wakes up and goes outside!
   Dragonblade> Stop teh pain...
T protoman_116> Then POOPS IN YOUR YARD!
   Dragonblade> I might forfeit...
T  NessTheHero> So THATS why there is chocolate stains on my PC! It steals chocolate too!!
   Dragonblade> If it keeps going like this
  Like javs & Hunt well come to ?go javufc  to have some fun -JDM37 <ER>
T protoman_116> You don't happen to Taste that chocolate... do you?
T  NessTheHero> No
   Dragonblade> Damnit
T protoman_116> Yes... it IS chocolate... of COURSE it is...
   Dragonblade> I have no chance of winning...
         Devin> make your time?
   Dragonblade> ARGH
   NessTheHero> WHAT YOU SAY!?
   Dragonblade> ...
  protoman_116> All your base are belong to me!
         Devin> bah. was typing the next line :P
T  NessTheHero> Team chat or I break your face
  protoman_116> You are on the way to Destruction!
T protoman_116> What you say?!
   Dragonblade> NO
   Dragonblade> Score?
   NessTheHero> 14 - 3
   Dragonblade> O.O
  protoman_116> Take off every ZIG!!!
   Dragonblade> Time?
         Devin> ziggy
T  NessTheHero> EYES ON ME IS PLAYING!!!!
  protoman_116> boogy
T  NessTheHero> YAY!!!!
         Devin> sniped OMG?
  protoman_116> lolz?
   Dragonblade> Timez0rz?
   NessTheHero> 4:00
  protoman_116> OMF WTG?!
   NessTheHero> wtfbbq
  protoman_116> OML WTG LOF
   Dragonblade> Devin... Congrats... you win... I forfeit
   NessTheHero> STOP
         Devin> O_o
  protoman_116> Why does everyone forfeit?
         Devin> yay?
   Dragonblade> Cause...
   NessTheHero> Final Score
   Dragonblade> I couldn't win!
   NessTheHero> Devin: 15
   NessTheHero> Dragonblade: 4
   Dragonblade> :O
         Devin> The verdict is...
         Devin> CRAZY AMERICAN PARTY!
   NessTheHero> Yay!
   Dragonblade> I really sucked that time
