  Log file open: SeriyuconvsProtoCouldDoThisSolo
C 1:protoman_116> GOODBYE!
C 1:protoman_116> :P
C 1:Jacen Solo> lol
C 1:Elios> Bet taker ready
C 1:UltraD> Thats nice
C 1:Seiryo> lol
       Devin> *begins talking in Hayate voice*
T     UltraD> Officials ready?
       Devin> *cough* Opponents ready?
C 1:Lucon> Seriously though, let's hurry this along.
T     UltraD> Devin?
C 1:Devin> so we take scores for how many deaths each team has?
C 1:Seiryo> Seiryucon
T     UltraD> Evin?
T     UltraD> Vin?
C 1:protoman_116> Yes
P      Elios> Hey? You ready?
T      Devin> yah yeah I'm getting things ready
       Devin> Teams Ready?
C 1:Jacen Solo> k
       Lucon> Yes.
C 1:Jacen Solo> yeah
T     UltraD> I say when go
      Seiryo> Yup!
T      Elios> I thought we needed two judges....
  protoman_1> As captain of this team, I say "YAY"
       Devin> *cough* Tournament match 1. Seiryucon Vs. Proto could do this Solo. *raises hand*
       Devin> COMMENCE!
      UltraD> WAIT!
       Lucon> What???
  Jacen Solo> too late
       Lucon> Let's just go.
      Seiryo> ....
T      Elios> Bets?
      UltraD> ...THE TIMER SAYS WHEN TO GO SO THAT HE CAN SET UP THE STOP WATCH!
       Lucon> ....
       Lucon> No.
       Elios> Yes
       Lucon> Crap.
T      Elios> Restart?
C 1:Devin> Bah. I started my stopwatch
       Lucon> Nooooo!
      UltraD> Did you guys not go to the last tourney matches
T     UltraD> No
T      Elios> Okay
      UltraD> Geez...
       Devin> Teams return to Starting positions.
      UltraD> No
      UltraD> no
      UltraD> np
      UltraD> It started, let it continue
T      Devin> you want to do the recall or not? >.<
T      Elios> Make up your minds people....
T     UltraD> Too late
T      Devin> I was told I was too be the judge and timer >.<
T      Elios> Okay, I put my bet on "Proto could do this solo"
T      Devin> how many deaths have each team had so far?
T     UltraD> So then whats the point of having different timers...
T     UltraD> Sigh
T      Elios> MVP for the match would go to Proto, I say
T     UltraD> Why must people always do something on important dates?
T      Elios> Devin, you're the judge, you need to kepp track of these things....
T      Devin> I was thinking we were recalling
T      Elios> ....
  protoman_1> damn
T      Elios> So you don't have their scores?
  protoman_1> Rapers
  protoman_1> :P
       Lucon> Agh.
T      Devin> I have them after the first minute or so of it Just wanted to make sure they were right
  protoman_1> hi
       Lucon> Noooo!
T      Elios> ......
T     UltraD> Whatever you have is good as long as you have recorded the kills and deaths
  protoman_1> CENSOR THAT
T      Elios> So, if you're misssing a minute of their scores, shouldn't we start over?
       Lucon> What?
T     UltraD> Of course, the smart thing to do is NOT TO KILL AT HOME WHEN WE WILL BEGIN
T      Elios> People can't do that, to much common sense for them
      Seiryo> woot
T     UltraD> So that it could be easier to keep track of the score
T      Elios> We can start over and do that, besides, we are missing a minute of their scores
T      Devin> seems Seriryucon is dominating
T     UltraD> Do you think they can handle it?
T      Devin> have it at 16 to 6
T      Elios> What, starting over? Yeah
  protoman_1> eat
  Jacen Solo> double eat
       Lucon> Okay.
T     UltraD> Hmmm...I don't know
T      Elios> One minute can make all the difference
T      Elios> It did in your match against GB
T     UltraD> So do we restart?
T      Elios> I say yes
T     UltraD> Devin?
T      Elios> But it's up to you and Devin
T      Devin> I had it down that in the first minute SC got 2 kills and PS got 1
       Lucon> Awwww.
       Lucon> I'm losing my edge!
T     UltraD> Well, its nearly ten minutes on my watch
T      Elios> Ten minutes left? Or into the match?
       Lucon> Damn.
T     UltraD> Into
T      Elios> Oh....
T     UltraD> I can just add a minute
T      Elios> Works for me
T     UltraD> Ok
T      Devin> that woks
T      Elios> But don't you announce scores every 5 minutes
T      Elios> ?
T     UltraD> Yes
T     UltraD> I need to announce at 11 and 16
  protoman_1> WE lost
T     UltraD> No, 15
T      Devin> 5 minutes left?
T     UltraD> Not yet
       Lucon> Yes you did.
T      Elios> On another note, bets?
T     UltraD> Seiryocon
T      Devin>  saw when to call score
T      Devin> say rahter
       Lucon> ...
  protoman_1> oh well
       Lucon> Jav?
  Jacen Solo> eat
      UltraD> You can use any ship but weasel
       Lucon> Well, there is no rule about ships.
T      Elios> Really?
T     UltraD> It was in the last tourney
       Lucon> Damn.
       Lucon> It's like rock paper scissors.
       Devin> *cough* Cloaking and use of weasels is prohibited.
T      Elios> Oh....
T      Elios> Guess everyone just prefers the WB
      UltraD> 5 minutes left
T      Elios> Scores Devin?
  protoman_1> why haven't you updated us on our SCORE?!
  Jacen Solo> score?
       Devin> *cough*... current standings... Team Seiryucon leads 25 to 15
  protoman_1> like you should have 5 minutes ago
      UltraD> It's comming
      UltraD> Haveth patience
  Next elimination match is starting. Type ?go baseelim to play
       Lucon> ...
       Elios> Lots of patience
  protoman_1> You already should have told us
T     UltraD> Scores?
       Lucon> Yes.
       Lucon> You should have.
      UltraD> Oh well
  Next elimination match is starting. Type ?go elim to play
      UltraD> Wait
  protoman_1> 10, 5, 1, and 0
T      Elios> Holy shit...go Seiryo....
T     UltraD> Devin?
T     UltraD> You there?
T      Devin> anounced scores.
       Lucon> ...
T     UltraD> Where?
T      Devin> after you sadi 5 minutes
T     UltraD> I don't see it
T      Elios> Me neither
       Lucon> I hate spiders now.
  Jacen Solo> gfu
  protoman_1> goodie
  Jacen Solo> ah
       Devin> *cough* creent standings... 31 to 21... Seiryucon leads. 
T     UltraD> They should stick together me thinks
  protoman_1> Ah...
       Elios> Devin's beceom dilusional, so you may have to wait for the scores
  protoman_1> ...
       Devin> I have announced the scores a couple time. 
  protoman_1> no you haven't
      UltraD> 1 minute left
  protoman_1> TELL 
  protoman_1> SCORES
  protoman_1> NOW
      UltraD> Hurry f00s
       Devin> 34to 25
       Lucon> In favor of we?
      UltraD> who is winning?
       Devin> Seiryucon.
       Lucon> w00t
  protoman_1> duh
       Lucon> Nice.
T      Devin> no one could see when I announced scores I said them like 4 times in the last few minutes.
T      Devin> ?
  protoman_1> you really need a judge to tell you your winning?
      Seiryo> rar...
T      Elios> Do you have individual scores down Devin?
      UltraD> Timeth is upeth
       Lucon> Okay.
T      Elios> And no
      UltraD> STOP!
  Jacen Solo> omfg
      UltraD> STOP I SAY!
T      Devin> no. I was counting for the whole team
  Jacen Solo> we NEVER got scores
T      Elios> Okay
      UltraD> Game is over
T      Devin> was going to fast to bother with personall
       Elios> Except once
      UltraD> Yes you did
  protoman_1> never
  protoman_1> yes, probably IN YOUR GUYS TEAM CHAT
      UltraD> Devin> 34to 25
       Elios> EVERYONE! MATCH OVER!
      UltraD> Lucon> In favor of we?
       Devin> I also announced them before that
  protoman_1> No you didn't
      UltraD> Then you guys are blind
  Jacen Solo> no did any of u get scores?
  Jacen Solo> seiryo or lucon?
  protoman_1> Actually, I have 20/15 vision, thank you
      UltraD> Either way, Lucon and Seiryo have won
